Восстановите строку по её коду и беспрефиксному коду символов. 

В первой строке входного файла заданы два целых числа k и l через пробел — количество различных букв, встречающихся в строке, и размер получившейся закодированной строки, соответственно. В следующих k строках записаны коды букв в формате "letter: code". Ни один код не является префиксом другого. Буквы могут быть перечислены в любом порядке. В качестве букв могут встречаться лишь строчные буквы латинского алфавита; каждая из этих букв встречается в строке хотя бы один раз. Наконец, в последней строке записана закодированная строка. Исходная строка и коды всех букв непусты. Заданный код таков, что закодированная строка имеет минимальный возможный размер.

В первой строке выходного файла выведите строку s. Она должна состоять из строчных букв латинского алфавита. Гарантируется, что длина правильного ответа не превосходит 10^4 символов.

# Solution:

```
def huffman_decoder(length, codes, s):
    decoded = ''
    buffer = ''
    i = 0

    while i < length:
        buffer += s[i]
        if buffer in codes:
            decoded += codes[buffer]
            buffer = ''
        i += 1
    return decoded

def main():
    num_letters, length = map(int, input().split())
    codes = {}
    for _ in range(num_letters):
        letter, code = input().split(': ')
        codes[code] = letter
    s = input()

    result = huffman_decoder(length, codes, s)
    print(result)

if __name__ == "__main__":
    main()
```